Repository: ham3da/hacklog-remote-attachment
Catalog: languages/hacklog-remote-attachment-*.po
Languages: fa_ir

source: upload file to remote server failed!
fa_ir: آپلود فایل در سرور FTP ناموفق بود !

source: Click <a href="%s">here</a> to setup the plugin options.
fa_ir: برای انجام تنظیمات افزونه <a href="%s"> اینجا کلیک کنید </a>.

source: failed to make dir on remote server! Please check your FTP permissions.
fa_ir: ایجاد مسیر در سرور راه دور با شکست مواجه شد! لطفاً سطح دسترسی های FTP خود را بررسی کنید.

source: Explanation of some Options
fa_ir: توضیح برخی گزینهها

source: <strong>Remote base URL</strong> is the URL to your Ftp root path.
fa_ir: <strong> آدرس پایه از راه دور </strong> نشانی اینترنتی مسیر ریشه Ftp شما است.

source: <strong>FTP Remote path</strong> is the relative path to your FTP main directory. Use "<strong>.</strong>" for FTP main(root) directory.You can use sub-directory Like <strong>wp-files</strong>
fa_ir: مسیر اولیه فایل‌ها بر روی مسیر اصلی FTP. برای استفاده از مسیر اصلی(روت) از "<strong>.</strong>" استفاده کنید. همچنین شما می‌توانید از مسیر زیر شاخه‌ای استفاده کنید مثل <strong>wp-files</strong>

source: <strong>HTTP Remote path</strong> is the relative path to your HTTP main directory. Use "<strong>.</strong>" for HTTP main(root) directory.You can use sub-directory Like <strong>wp-files</strong>
fa_ir: <strong>مسیر HTTP از راه دور</strong> مسیر اولیه HTTP روی هاست شما. برای استفاده از ریشه هاست یا همان روت از "<strong>.</strong>" استفاده کنید. همچنین شما می‌توانید از زیر شاخه استفاده نمایید مانند: <strong>wp-files</strong>

source: For more information:
fa_ir: برای اطلاعات بیشتر:

source: Please visit the <a href="http://ihacklog.com/?p=5001" target="_blank">Plugin Home Page</a>
fa_ir: لطفاً از <a href="http://ihacklog.com/?p=5001" target="_blank">صفحه افزونه</a> بازدید کنید

source: %s Help
fa_ir: %s راهنما

source: Hacklog Remote Attachment Options
fa_ir: تنظیمات اتصال به هاست دانلود از راه دور

source: Remote Attachment
fa_ir: پیوست فایل از راه دور

source: Options updated.
fa_ir: تنظیمات به روز رسانی شدند.

source: Nothing changed.
fa_ir: چیزی تغییر نکرده است.

source: Connected successfully.
fa_ir: اتصال با موفقیت برقرار شد.

source: Failed to connect to remote server!
fa_ir: اتصال به سرور از راه دور ناموفق بود!

source: posts has been updated.
fa_ir: پست به روز رسانی شد.

source: no posts been updated.
fa_ir: هیچ پستی به روز رسانی نشده است.

source: Ftp server
fa_ir: سرور FTP

source: the IP or domain name of remote file server.
fa_ir: آی پی یا نام دامنه سرور فایل‌های راه درو.

source: Ftp server port
fa_ir: پورت FTP

source: the listenning port of remote FTP server.
fa_ir: پورت FTP خود را وارد کنید ، معمولا به صورت پیشفرض 21 می باشد.

source: Ftp username
fa_ir: نام کاربری FTP

source: the Ftp username.
fa_ir: نام کاربری FTP.

source: Ftp password
fa_ir: رمز عبور FTP

source: the password.
fa_ir: رمز عبور FTP.

source: Ftp timeout
fa_ir: زمان انتظار FTP

source: FTP connection timeout.
fa_ir: مدت زمان انتظار برای اتصال به سرور FTP.

source: Remote base URL
fa_ir: آدرس پایه اتصال از راه دور

source: Remote base URL,the URL to your Ftp root path.for example: <strong>http://www.your-domain.com</strong>.
fa_ir: آدرس پایه فایل‌ها در واقع آدرس اینترنتی هاست دانلود شما می‌باشد. مانند : <strong>http://www.your-domain.com</strong>.

source: FTP Remote path
fa_ir: مسیر فایل‌ها در FTP

source: the relative path to your FTP main directory. Use "<strong>.</strong>" for FTP main(root) directory.You can use sub-directory Like <strong>wp-files</strong>
fa_ir: مسیر اولیه فایل‌ها بر روی مسیر ریشه FTP. برای استفاده از ریشه هاست یا همان روت از "<strong>.</strong>" استفاده کنید. همچنین شما می‌توانید از مسیر زیر شاخه‌ای استفاده کنید مانند <strong>wp-files</strong>

source: HTTP Remote path
fa_ir: مسیر HTTP فایل‌ها

source: the relative path to your HTTP main directory. Use "<strong>.</strong>" for HTTP main(root) directory.You can use sub-directory Like <strong>wp-files</strong>
fa_ir: مسیر اولیه HTTP بر روی ریشه هاست. برای استفاده از ریشه هاست یا همان روت از "<strong>.</strong>" استفاده کنید. همچنین شما میتوانید از زیر شاخه استفاده نمایید مانند: <strong>wp-files</strong>

source: Save Options
fa_ir: ذخیره تنظیمات

source: Hacklog Remote Attachment Status
fa_ir: وضعیت پیوست فایلها از راه دور

source: Space used on remote server:
fa_ir: فضای مورد استفاده در سرور راه دور:

source: warning:
fa_ir: هشدار:

source: if you haven't moved all your attachments OR dont't know what below means,please <strong>DO NOT</strong> click the link below!
fa_ir: اگر شما تمام پیوست های خود را منتقل نکرده‌اید یا نمی‌دانید که منظور از عبارات زیر چیست، لطفاً هیچ کاری <strong>انجام ندهید</strong>!

source: Move
fa_ir: انتقال

source: if you have moved all your attachments to the remote server, then you can click
fa_ir: اگر شما تمام پیوست های خود را به سرور راه دور منتقل کرده‌اید، می‌توانید کلیک کنید

source: Are your sure to do this?Make sure you have backuped your database tables.
fa_ir: آیا برای انجام این کار مطمئن هستید؟ اطمینان حاصل کنید که از پایگاه داده خود پشتیبان تهیه کرده‌اید.

source: here
fa_ir: اینجا

source: to update the database.
fa_ir: برای به روز رسانی پایگاه داده.

source: Recovery
fa_ir: بازیابی

source: if you have moved all your attachments from the remote server to local server, then you can click
fa_ir: اگر همه پیوست‌های خود را از سرور راه دور به سرور محلی منتقل کرده باشید، می‌توانید کلیک کنید

source: Hacklog Remote Attachment
fa_ir: پیوست فایل از راه دور

source: WordPress 远程附件上传插件.Remote attachment support for WordPress.Support Multisite.
fa_ir: افزونه پیوست فایل‌ها از راه دور از وردپرس چند سایته نیز پشتیبانی می کند.

source: http://ihacklog.com/
fa_ir: http://ham3da.ir/
